app/controllers/cars_controller.rb

SELECT  "manufacturers".* FROM "manufacturers"  ORDER BY "manufacturers"."id" ASC LIMIT 1
---
  def new
    @car = Car.new
    @manufacturers = Manufacturer.all

SELECT  "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT 1  [["id", 22]]
INSERT INTO "cars" ("color", "mileage", "year", "manufacturer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["color", "blue"], ["mileage", 29929.0], ["year", "1982-01-01"], ["manufacturer_id", 2], ["created_at", "2015-01-03 00:42:56.681220"], ["updated_at", "2015-01-03 00:42:56.681220"]]
SELECT "manufacturers".* FROM "manufacturers"
---
  def create

    @manufacturer = Manufacturer.find(params[:car][:id])
    params[:car][:year] = "31-12-#{params[:car][:year]}".to_date
    params[:car][:color] = params[:car][:color].capitalize
    @car = @manufacturer.cars.build(car_params)

    if @car.save
      redirect_to cars_path, :notice => "Car successfully added"
    else
      @manufacturers = Manufacturer.all