app/controllers/manufacturers_controller.rb

INSERT INTO "manufacturers" ("name", "description", "country", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Toyota"], ["description", ""], ["country", "JP"], ["created_at", "2015-01-02 15:22:21.453050"], ["updated_at", "2015-01-02 15:22:21.453050"]]
---
  def create

    params[:manufacturer][:country] = params[:country]

    @manufacturer = Manufacturer.create(manufacturer_params)