app/views/manufacturers/index.html.erb

SELECT "cars".* FROM "cars" WHERE "cars"."manufacturer_id" = $1  [["manufacturer_id", 13]]
---
        <li>-------------</li>
        <p><%manufacturer.cars.each do|car|%>